## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.DownloadFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/bb9c11f30d7d935e5cfd66cb467b035b.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "048f9424e263ec9760198f0f970b22cc-4" -> (known after apply)
      ~ id                     = "bb9c11f30d7d935e5cfd66cb467b035b.zip" -> (known after apply)
      ~ key                    = "bb9c11f30d7d935e5cfd66cb467b035b.zip" -> "82a57d9dd857aae415bd81259862b5a2.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "Bm2mRS8uW8XS79PovjBQYB2MzyCQMpi7" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadFFISSpreadsheet"
      ~ last_modified                  = "2026-02-18T21:29:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-DownloadFFISSpreadsheet:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-DownloadFFISSpreadsheet:3/invocations" -> (known after apply)
      ~ s3_key                         = "bb9c11f30d7d935e5cfd66cb467b035b.zip" -> "82a57d9dd857aae415bd81259862b5a2.zip"
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.DownloadFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["SQSQueueNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "SQSQueueNotification" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/f9bfa39b9452ce04e9149a63c8f48f8c.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "36de2ab78c38928f8a393cbbdf8aab68-4" -> (known after apply)
      ~ id                     = "f9bfa39b9452ce04e9149a63c8f48f8c.zip" -> (known after apply)
      ~ key                    = "f9bfa39b9452ce04e9149a63c8f48f8c.zip" -> "4a8b1e7b2f39d8ff08c26a5d3929139e.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "Ijvf.gfnJ4tqv2WIFRHxxKYZYK_qiphF" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-DownloadGrantsGovDB"
      ~ last_modified                  = "2026-02-18T21:29:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-DownloadGrantsGovDB:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-DownloadGrantsGovDB:3/invocations" -> (known after apply)
      ~ s3_key                         = "f9bfa39b9452ce04e9149a63c8f48f8c.zip" -> "4a8b1e7b2f39d8ff08c26a5d3929139e.zip"
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "Schedule" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/58eadac61e7365f094a039341d4fdbc2.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "0b9ea59633de1ebc2c73fbc5a4c4ab0f-4" -> (known after apply)
      ~ id                     = "58eadac61e7365f094a039341d4fdbc2.zip" -> (known after apply)
      ~ key                    = "58eadac61e7365f094a039341d4fdbc2.zip" -> "1cc94b3b7c56c981c359b159edfbe9ac.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "WVbDC68b8vGTL.K95nMCGYdPJaJUndTj" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-EnqueueFFISDownload"
      ~ last_modified                  = "2026-02-18T21:29:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-EnqueueFFISDownload:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-EnqueueFFISDownload:3/invocations" -> (known after apply)
      ~ s3_key                         = "58eadac61e7365f094a039341d4fdbc2.zip" -> "1cc94b3b7c56c981c359b159edfbe9ac.zip"
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.EnqueueFFISDownload.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/bab27c2ea1134e3c8520dfb242887244.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "72b313cbab45becb1d924fe2a017d12c-4" -> (known after apply)
      ~ id                     = "bab27c2ea1134e3c8520dfb242887244.zip" -> (known after apply)
      ~ key                    = "bab27c2ea1134e3c8520dfb242887244.zip" -> "e828c52af86496178d34024b4a66fa27.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "bYdBshMACy3rdhIV0Z5GUKcC0t6P8zrK" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ExtractGrantsGovDBToXML"
      ~ last_modified                  = "2026-02-18T21:29:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-ExtractGrantsGovDBToXML:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-ExtractGrantsGovDBToXML:3/invocations" -> (known after apply)
      ~ s3_key                         = "bab27c2ea1134e3c8520dfb242887244.zip" -> "e828c52af86496178d34024b4a66fa27.zip"
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ExtractGrantsGovDBToXML.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/4201009022dfdec6522b24902c6d3a7d.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1dc8cb9a04fd2b8e738f53a321b5e3f1-4" -> (known after apply)
      ~ id                     = "4201009022dfdec6522b24902c6d3a7d.zip" -> (known after apply)
      ~ key                    = "4201009022dfdec6522b24902c6d3a7d.zip" -> "f7a767804551f5dfed9dba20907181b7.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "ItxJNyxsfbHqqkEHjjb1GeW0r6DCqyeu" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistFFISData"
      ~ last_modified                  = "2026-02-18T21:29:23.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PersistFFISData:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PersistFFISData:3/invocations" -> (known after apply)
      ~ s3_key                         = "4201009022dfdec6522b24902c6d3a7d.zip" -> "f7a767804551f5dfed9dba20907181b7.zip"
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.PersistFFISData.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/fb9a59f4965bdc88d10de9b92ab364ab.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "1b3930b45bc76064334b740afc9508be-4" -> (known after apply)
      ~ id                     = "fb9a59f4965bdc88d10de9b92ab364ab.zip" -> (known after apply)
      ~ key                    = "fb9a59f4965bdc88d10de9b92ab364ab.zip" -> "131f99f72915af26a6eaf7a037591550.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "mGVuIn5tRdR5BiQIrUc2jdvIdneTaBAd" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PersistGrantsGovXMLDB"
      ~ last_modified                  = "2026-02-18T21:29:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PersistGrantsGovXMLDB:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PersistGrantsGovXMLDB:3/invocations" -> (known after apply)
      ~ s3_key                         = "fb9a59f4965bdc88d10de9b92ab364ab.zip" -> "131f99f72915af26a6eaf7a037591550.zip"
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.PersistGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/1d1b2b4adee95a0451f046cf987829b5.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "628cc5274fc72ebada95a78a5deb748b-4" -> (known after apply)
      ~ id                     = "1d1b2b4adee95a0451f046cf987829b5.zip" -> (known after apply)
      ~ key                    = "1d1b2b4adee95a0451f046cf987829b5.zip" -> "1ef7347723c2d5a9a080990b08681394.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "iWWIIadxOX39wVNzShaeherP_0m.kC4T" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-PublishGrantEvents"
      ~ last_modified                  = "2026-02-18T21:29:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PublishGrantEvents:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-PublishGrantEvents:3/invocations" -> (known after apply)
      ~ s3_key                         = "1d1b2b4adee95a0451f046cf987829b5.zip" -> "1ef7347723c2d5a9a080990b08681394.zip"
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.PublishGrantEvents.module.lambda_function.aws_lambda_permission.current_version_triggers["dynamodb"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "dynamodb" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/87cc692856e8b99c8a3ea56a5998bd8c.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "fe63c7ebcf7ac0c137001f0fc2565278-4" -> (known after apply)
      ~ id                     = "87cc692856e8b99c8a3ea56a5998bd8c.zip" -> (known after apply)
      ~ key                    = "87cc692856e8b99c8a3ea56a5998bd8c.zip" -> "ddf5b95ac82be12088c3897bf7b505e1.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "usGBeBU2H6R.tsYMEDXn8FFNt4MOCrgA" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-ReceiveFFISEmail"
      ~ last_modified                  = "2026-02-18T21:29:23.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-ReceiveFFISEmail:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-ReceiveFFISEmail:3/invocations" -> (known after apply)
      ~ s3_key                         = "87cc692856e8b99c8a3ea56a5998bd8c.zip" -> "ddf5b95ac82be12088c3897bf7b505e1.zip"
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ReceiveFFISEmail.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/c267265f8232d09eaa8da087963995b4.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "5a6424a27a1b64b9ae6a6e7990bac35a-4" -> (known after apply)
      ~ id                     = "c267265f8232d09eaa8da087963995b4.zip" -> (known after apply)
      ~ key                    = "c267265f8232d09eaa8da087963995b4.zip" -> "4006192dd256303b7546cf93d5c4753f.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "f7evsY2yOQnGjFZ.IdJSE6kItZZvfEuh" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitFFISSpreadsheet"
      ~ last_modified                  = "2026-02-18T21:29:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-SplitFFISSpreadsheet:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-SplitFFISSpreadsheet:3/invocations" -> (known after apply)
      ~ s3_key                         = "c267265f8232d09eaa8da087963995b4.zip" -> "4006192dd256303b7546cf93d5c4753f.zip"
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.SplitFFISSpreadsheet.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_artifact.aws_s3_object.lambda_function must be replaced
-/+ resource "aws_s3_object" "lambda_function" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::grantsingest-lambdaartifacts-741448944595-us-east-2/dd0dba10cf8cf5a7059b1c810bfcf725.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "30b6370cb0555d592a4dd23acc557e8b-4" -> (known after apply)
      ~ id                     = "dd0dba10cf8cf5a7059b1c810bfcf725.zip" -> (known after apply)
      ~ key                    = "dd0dba10cf8cf5a7059b1c810bfcf725.zip" -> "ba6d0f40915b792df93d8e8be70dc3a7.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "9C1Tx5NzxotRTEBwsudmTnXRnV4TheYD" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "grants_ingest-SplitGrantsGovXMLDB"
      ~ last_modified                  = "2026-02-18T21:29:22.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-SplitGrantsGovXMLDB:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:741448944595:function:grants_ingest-SplitGrantsGovXMLDB:3/invocations" -> (known after apply)
      ~ s3_key                         = "dd0dba10cf8cf5a7059b1c810bfcf725.zip" -> "ba6d0f40915b792df93d8e8be70dc3a7.zip"
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "3" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 20 to add, 10 to change, 20 to destroy.
```

</details>

*Pusher: @dependabot[bot], Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/navapbc/grants-ingest/actions/runs/23131457401)*